app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def show
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-01-15 20:31:46.591811"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(params[:id])
    @school_class.update(school_class_params(:title, :room_number))