app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
---
  def show
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-01-15 20:30:23.220683"], ["id", 1]]
---
  def update
    @student = Student.find_by(params[:id])
    @student.update(student_params(:first_name, :last_name))